In [ ]:
# import pandas as pd
# df = pd.read_cvs('file.cvs')

In [4]:
import pandas as pd

data = [10, 20, 30, 40, 50]

s = pd.Series(data)

print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
print(s[2])

30

In [6]:
print(s.iloc[3])

40

In [7]:
print(s[1:4])

1    20
2    30
3    40
dtype: int64

In [9]:
import pandas as pd
data = {'Name':['alice','bobola', 'chalier','david'],
        'Age':[24, 25, 26, 27],
        'City':['New york', 'san fransico', 'los angeles', 'US']}
df = pd.DataFrame(data)
print(df)

      Name  Age          City
0    alice   24      New york
1   bobola   25  san fransico
2  chalier   26   los angeles
3    david   27            US

In [10]:
print(df['Name'])

0      alice
1     bobola
2    chalier
3      david
Name: Name, dtype: object

In [11]:
print(df.iloc[2])

Name        chalier
Age              26
City    los angeles
Name: 2, dtype: object

In [20]:
print(df[['Name', 'Age']])
print(df[1:3])

      Name  Age
0    alice   24
1   bobola   25
2  chalier   26
3    david   27
      Name  Age          City
1   bobola   25  san fransico
2  chalier   26   los angeles

In [22]:
df.to_csv('trading_data.csv', index=False)

In [27]:
x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}
df =pd.DataFrame(x)
print(df)

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [29]:
x = df[['ID']]

In [34]:
type(x)

pandas.core.frame.DataFrame

In [37]:
z = df[['ID', 'Department', 'Salary']]
print(z)

   ID       Department  Salary
0   1  Architect Group  100000
1   2   Software Group   80000
2   3      Design Team   50000
3   4   Infrastructure   60000

##### Problem 2: Retrieve the Marks column and assign it to a variable b

In [38]:
a = {'Student':['David', 'Samuel', 'Terry', 'Evan'],
     'Age':['27', '24', '22', '32'],
     'Country':['UK', 'Canada', 'China', 'USA'],
     'Course':['Python','Data Structures','Machine Learning','Web Development'],
     'Marks':['85','72','89','76']}
df1 = pd.DataFrame(a)
df1

  Student Age Country            Course Marks
0   David  27      UK            Python    85
1  Samuel  24  Canada   Data Structures    72
2   Terry  22   China  Machine Learning    89
3    Evan  32     USA   Web Development    76

In [40]:
b = df1[['Marks']]
print(b)

  Marks
0    85
1    72
2    89
3    76

##### Problem 3: Retrieve the Country and Course columns and assign it to a variable c

In [45]:
c = df1[['Country' , 'Course']]
print(c)

  Country            Course
0      UK            Python
1  Canada   Data Structures
2   China  Machine Learning
3     USA   Web Development

In [48]:
df1.iloc[1,3]

'Data Structures'

In [55]:
df.loc[1, 'ID']

2

In [60]:
df2 = df
df2 = df2.set_index("ID")
df2.head()

    Name       Department  Salary
ID
1   Rose  Architect Group  100000
2   John   Software Group   80000
3   Jane      Design Team   50000
4   Mary   Infrastructure   60000

In [66]:
df2.loc[3 , 'Salary']

50000

In [68]:
df2 = df
df2 = df2.set_index('Name')
df2.head()

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

Use the <code>loc()</code> function,to get the Department of Jane in the newly created dataframe df2.

In [73]:
df2.loc['Jane', 'Department']

'Design Team'

Use the iloc() function to get the Salary of Mary in the newly created dataframe df2

In [74]:
df2.iloc[3, 2]

60000

In [78]:
# let us do the slicing using old dataframe df

df.iloc[0:4,0:2]

   Name  ID
0  Rose   1
1  John   2
2  Jane   3
3  Mary   4

In [79]:
#let us do the slicing using loc() function on old dataframe df where index column is having labels as 0,1,2
df.loc[0:2,'ID':'Department']

   ID       Department
0   1  Architect Group
1   2   Software Group
2   3      Design Team

In [80]:
df.loc[2:3,'Name':'Department']

   Name  ID      Department
2  Jane   3     Design Team
3  Mary   4  Infrastructure